app/controllers/api/v1/fruits_controller.rb

SELECT "fruits".* FROM "fruits"
---
  def index
    @fruits = Fruit.all

INSERT INTO "fruits" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["description", "This is test fruit"], ["created_at", "2018-07-27 16:04:25.957508"], ["updated_at", "2018-07-27 16:04:25.957508"]]
---
  def create
    @fruit = Fruit.create(fruit_params)

SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def update
    @fruit = Fruit.find(params[:id])

SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "fruits" WHERE "fruits"."id" = ?  [["id", 9]]
---
  def destroy
    @fruit = Fruit.find(params[:id])
    @fruit.delete